run/Duan-2013EHT-Kistler/0.orig/fluid/dml
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dml;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

  top
  {
      type            zeroGradient;
      
  }

  fluid_to_heater
  {
        type           zeroGradient;
  }
  
  side
  {
      type            zeroGradient;
      
  }
  front
  {
    type wedge;
  }
  back
  {
    type wedge;
  }

  axis
  {
    type empty;
  }
}

// ************************************************************************* //
