run/Duan-2013EHT-Kistler/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../simSetup"

scale 1;

vertices        
(
    (0  #calc "-$HeightS" 0)
    ($Width #calc "-$HeightS" #calc "-$ThickW")
    ($Width $HeightF  #calc "-$ThickW")
    (0 $HeightF 0) 

    (0  #calc "-$HeightS" 0)
    ($Width #calc "-$HeightS" $ThickW)
    ($Width $HeightF $ThickW)
    (0 $HeightF 0) 
);

blocks
(
hex (0 1 2 3 4 5 6 7) ($nx $ny 1) simpleGrading (1 1 1)
);
 
edges
(
);
 
boundary
(
     front
     { 
           type wedge;
           faces  
           (
               (0 1 2 3)
           );
      }
     back
     { 
           type wedge;
           faces  
           (
               (6 7 4 5)
           );
      }
     side
     { 
           type patch;
           faces  
           (
               (2 6 5 1)
           );
      }
     bottom
     { 
           type wall;
           faces  
           (
               (0 1 5 4)
           );
      }
     top
     { 
           type patch;
           faces  
           (
               (7 6 2 3)
           );
      }
     axis
     { 
           type empty;
           faces  
           (
               (0 4 7 3)
           );
      }
);
 
mergePatchPairs
(
);

// ************************************************************************* //