run/Duan-2013EHT-Kistler/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiRegionPhaseChangeFlowML;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         25e-3;

deltaT         1e-9;

writeControl    adjustableRunTime;

writeInterval   1e-4;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression no;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo               0.5;
maxAlphaCo          0.5;
maxCapillaryNum     1e8;
maxDeltaT           1.0; //1e-4

maxDi               1e8;

libs 
(
    "libpostProcess.so"
    // "libdynamicLoadBalanceFvMesh.so"	
    // "libtwoPhasePropertiesIFPEN.so"	
       "libdynContactAngleModelComp.so"
);

// ************************************************************************* //
functions
{

//----------------------------------------------------------------------------//
//- Function to sample the interface.
 /*       freeSurface
   {
       type            surfaces;
       libs            ("libsampling.so");
       surfaceFormat  raw;
       executeControl  timeStep;
       executeInterval 500;
       writeControl    timeStep;
       writeInterval 500;
       sampleOnExecute true;
       region fluid;
       fields
       (
           alpha.water
       );
       surfaces
       (
           freeSurface
           {
               type        isoSurfaceCell;
               isoField    alpha.water;
               isoValue    0.5;
               interpolate true;
               regularise  false;
           }
       );
       interpolationScheme cellPointFace;
   }
    */
    // interfaceEnergyFluxes1
    // {
    // type        interfaceEnergyFluxes;
    // libs        ("libfieldFunctionObjects.so");
    // writeControl    timeStep;
    // writeInterval   100;
    // region fluid;
    // patches     ("fluid_to_solid");
    // };
    // interfaceRegion1
    // {
    // type        interfaceRegion;
    // libs        ("libfieldFunctionObjects.so");
    // writeControl    timeStep;
    // writeInterval   100;
    // region fluid;
    // nLayers 3;
    // patches     ("fluid_to_solid");
    // };
    // wallHeatFluxSolid1
    // {
    // type        wallHeatFluxSolid;
    // libs        ("libfieldFunctionObjects.so");
    // writeControl    timeStep;
    // writeInterval   100;
    // region fluid;
    // patches     ("fluid_to_solid");
    // };
    // superheated1
    // {
    // type        superHeated;
    // libs        ("libfieldFunctionObjects.so");
    // executeControl  timeStep;
    // executeInterval 100;
    // writeControl    timeStep;
    // writeInterval   100;
    // region fluid;
    // TSat    uniform 298.15;
    // patches     ("fluid_to_solid");
    // };

    bubbleIntegral
   {
       libs        ("libutilityFunctionObjects.so");
        type coded;
       // Name of on-the-fly generated functionObject
        name bubbleIntegral;
        // executeControl  timeStep;
        // executeInterval 10;
        // writeControl    timeStep;
        // writeInterval   10;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
        region fluid;
        enabled true;
        log true;
       
       codeOptions
       #{
           -I$(LIB_SRC)/finiteVolume/lnInclude \
           -I$(LIB_SRC)/OpenFOAM/lnInclude
       #};
        codeInclude
       #{
           #include "volFieldsFwd.H"
           #include "OFstream.H"
           #include <iostream>
       #};
       
       codeData
       #{
             autoPtr<OFstream> outputFilePtr;
       #};
           
       codeRead
       #{
          
            outputFilePtr.reset(new OFstream("./postProcessing/bubbleIntegral.dat"));
          
       #};
       
       codeExecute
       #{
            const volScalarField& alpha1 = mesh().lookupObject<volScalarField>("alpha.water");
            const label fluidPatchID = alpha1.mesh().boundaryMesh().findPatchID("fluid_to_heater");
            const fvPatch& fluidPatch = mesh().boundary()[fluidPatchID];
            const labelList& fluidFaceCells = fluidPatch.faceCells();


            scalar x (0.0);
            scalar y (0.0);
            scalar V (0.0);
            scalar A (0.0);
            scalar intTot (0.0);
            scalar pi (3.1415926535897);

            scalar max_x (0.0);
            scalar max_y (0.0);
            scalar base_x (0.0);
            // scalar base_y (1.0);

            scalar Deq (0.0);

            const faceList & ff = alpha1.mesh().faces();
            const pointField & pp = alpha1.mesh().points();

            forAll(fluidPatch, faceI)
            {
                const scalar fluidCellI = fluidFaceCells[faceI];
                if (alpha1[fluidCellI] < 0.999)
                {      
                    x = alpha1.mesh().C()[fluidCellI].x();
                    if (x>base_x)
                    {
                        base_x = x;
                    }  
                }
            }

            
            forAll(alpha1,cellI)
            {
                if (alpha1[cellI] < 0.999)
                {        

                    V = alpha1.mesh().V()[cellI];
                    x = alpha1.mesh().C()[cellI].x();
                    y = alpha1.mesh().C()[cellI].y();

                    if (x>max_x)
                    {
                        max_x = x;
                    }

                    if (y>max_y)
                    {
                        max_y = y;
                    }
                    
                    // if (y <= base_y && x > base_x)
                    // {
                    //     base_y = y;
                    //     base_x = x;
                    // }
                

                    const cell & cc = alpha1.mesh().cells()[cellI];
                    labelList pLabels(cc.labels(ff));
                    pointField pLocal(pLabels.size(), vector::zero);

                    forAll (pLabels, pointI)
                        pLocal[pointI] = pp[pLabels[pointI]];

                    scalar zDim = Foam::max(pLocal & vector(0,0,1)) - Foam::min(pLocal & vector(0,0,1));

                    A = (V/(zDim));
                    intTot += (1.0 - alpha1[cellI])*2*pi*x*A;
            
                }
            }

            reduce(intTot, sumOp<scalar>());

            Deq =  std::cbrt((6*intTot)/(pi));
            //reduce(Deq, sumOp<scalar>());

            // outputFilePtr() << mesh().time().timeName() << " " << intTot << " " << Deq << " " << max_x << " " << max_y << " "<< base_x << endl;
          
            if (Pstream::myProcNo() == 0)
            {
                outputFilePtr() << mesh().time().timeName() << " " << intTot << " " << Deq << " " << max_x << " " << max_y << " "<< base_x << endl;
            }
            
            Info << "intTot = "  << mesh().time().timeName() << " " << intTot << " " << Deq << endl;
            
       #};
       
       codeWrite
       #{   #};
   }

   surfaceTemp
   {
       libs        ("libutilityFunctionObjects.so");
        type coded;
        name    surfaceTemp;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
        region heater;
       
       codeOptions
       #{
           -I$(LIB_SRC)/finiteVolume/lnInclude \
           -I$(LIB_SRC)/OpenFOAM/lnInclude
       #};
        codeInclude
       #{
           #include "volFieldsFwd.H"
           #include "OFstream.H"
           #include <iostream>
       #};
       
       codeData
       #{
             autoPtr<OFstream> outputFilePtr;
       #};
           
       codeRead
       #{
          
            outputFilePtr.reset(new OFstream("./postProcessing/surfaceTemp.dat"));
          
       #};
       
       codeExecute
       #{
       
            const volScalarField& T = mesh().lookupObject<volScalarField>("T");
            scalar x (0.0);

            outputFilePtr() << mesh().time().timeName();

            forAll(T,cellI)
            {
                x = T.mesh().C()[cellI].x();
                outputFilePtr() << " " << x << " ";
            }
            outputFilePtr() << endl << mesh().time().timeName();    

            forAll(T,cellI)
            {
                outputFilePtr() << " " << T[cellI] << " ";
            }
            outputFilePtr() << endl;    

            /*          
            if (Pstream::myProcNo() == 0)
            {
                outputFilePtr() << mesh().time().timeName() << " " << intTot << " " << Deq << " " << max_x << " " << max_y << endl;
            }
            */
            //Info << "intTot = "  << mesh().time().timeName() << " " << intTot << " " << Deq << endl;
            
       #};
       
       codeWrite
       #{   #};
   }


     microlayer
   {
       libs        ("libutilityFunctionObjects.so");
        type coded;
        name    microlayer;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
        region fluid;
       
       codeOptions
       #{
           -I$(LIB_SRC)/finiteVolume/lnInclude \
           -I$(LIB_SRC)/OpenFOAM/lnInclude
       #};
        codeInclude
       #{
           #include "volFieldsFwd.H"
           #include "OFstream.H"
           #include <iostream>
       #};
       
       codeData
       #{
             autoPtr<OFstream> outputFilePtr;
       #};
           
       codeRead
       #{
          
            outputFilePtr.reset(new OFstream("./postProcessing/microlayer.dat"));
          
       #};
       
       codeExecute
       #{
       
            const volScalarField& dml = mesh().lookupObject<volScalarField>("dml");
            scalar x (0.0);
            const label fluidPatchID = mesh().boundaryMesh().findPatchID("fluid_to_heater");
            const polyPatch& fluidPatch = mesh().boundaryMesh()[fluidPatchID];
            const labelUList& fluidFaceCells = fluidPatch.faceCells();

            outputFilePtr() << mesh().time().timeName();

            forAll(fluidFaceCells,cellI)
            {
                x = dml.mesh().C()[cellI].x();
                outputFilePtr() << " " << x << " ";
            }
            outputFilePtr() << endl << mesh().time().timeName();    

            forAll(fluidFaceCells,cellI)
            {
                outputFilePtr() << " " << dml[cellI] << " ";
            }
            outputFilePtr() << endl;    

            /*          
            if (Pstream::myProcNo() == 0)
            {
                outputFilePtr() << mesh().time().timeName() << " " << intTot << " " << Deq << " " << max_x << " " << max_y << endl;
            }
            */
            //Info << "intTot = "  << mesh().time().timeName() << " " << intTot << " " << Deq << endl;
            
       #};
       
       codeWrite
       #{   #};
   }
}
